[
  {
    "id": "RISK-001",
    "title": "Real-time data synchronization complexity",
    "description": "Managing real-time updates across multiple data sources (GitHub, Jira, internal APIs) while maintaining consistency and handling network failures gracefully.",
    "category": "technical",
    "probability": 3,
    "impact": 4, 
    "owner": "Backend Specialist AI",
    "status": "mitigating",
    "mitigation": "Implementing event-driven architecture with message queues, implementing graceful degradation to cached data, and comprehensive monitoring of data freshness.",
    "contingency": "Fall back to batch updates every 5 minutes if real-time sync fails",
    "identifiedDate": "2024-01-10T14:30:00Z",
    "lastReviewed": "2024-01-16T09:15:00Z"
  },
  {
    "id": "RISK-002", 
    "title": "User adoption slower than expected",
    "description": "Development teams may resist adopting a new dashboard tool, preferring existing tools or manual processes they're comfortable with.",
    "category": "business",
    "probability": 3,
    "impact": 4,
    "owner": "Mandy",
    "status": "monitoring",
    "mitigation": "Conducting user interviews, implementing gradual rollout with early adopter teams, providing comprehensive training materials, and ensuring easy migration from existing tools.",
    "contingency": "Pivot to integration-heavy approach, embedding into existing tools rather than replacing them",
    "identifiedDate": "2024-01-08T10:00:00Z",
    "lastReviewed": "2024-01-15T16:30:00Z"
  },
  {
    "id": "RISK-003",
    "title": "Performance degradation with large datasets",
    "description": "Dashboard performance may suffer when displaying data from large projects with thousands of tasks, extensive history, or complex dependency graphs.",
    "category": "technical",
    "probability": 4,
    "impact": 3,
    "owner": "Krin", 
    "status": "mitigating",
    "mitigation": "Implementing virtual scrolling, pagination, data aggregation strategies, and intelligent caching layers. Conducting performance testing with simulated large datasets.",
    "contingency": "Implement progressive disclosure and summary views for large datasets",
    "identifiedDate": "2024-01-12T11:45:00Z",
    "lastReviewed": "2024-01-16T13:20:00Z"
  },
  {
    "id": "RISK-004",
    "title": "Third-party API rate limiting",
    "description": "GitHub and Jira APIs have rate limits that could restrict our ability to provide real-time updates for active projects, especially during peak usage.",
    "category": "external",
    "probability": 4, 
    "impact": 3,
    "owner": "Backend Specialist AI",
    "status": "identified",
    "mitigation": "Implementing intelligent caching strategies, request batching, multiple API key rotation, and fallback to webhook-based updates where available.",
    "contingency": "Reduce update frequency during rate limit periods and implement user notifications",
    "identifiedDate": "2024-01-14T09:30:00Z",
    "lastReviewed": "2024-01-16T08:45:00Z"
  },
  {
    "id": "RISK-005",
    "title": "Key team member availability",
    "description": "Heavy reliance on Krin for AI coordination and technical architecture decisions could create bottlenecks if availability becomes limited.",
    "category": "resource",
    "probability": 2,
    "impact": 4,
    "owner": "Mandy",
    "status": "monitoring",
    "mitigation": "Cross-training team members on critical systems, comprehensive documentation of architectural decisions, and establishing clear escalation procedures.",
    "contingency": "Engage external technical advisor and prioritize knowledge transfer sessions",
    "identifiedDate": "2024-01-11T15:20:00Z", 
    "lastReviewed": "2024-01-16T14:10:00Z"
  },
  {
    "id": "RISK-006",
    "title": "Security vulnerabilities in dependencies",
    "description": "Using multiple npm packages and third-party integrations increases attack surface and potential for security vulnerabilities in our supply chain.",
    "category": "technical",
    "probability": 3,
    "impact": 4,
    "owner": "Backend Specialist AI",
    "status": "mitigating",
    "mitigation": "Automated dependency scanning, regular security updates, minimal dependency policy, and security-focused code reviews. Implementing CSP headers and input validation.",
    "contingency": "Rapid incident response plan and automated rollback capabilities",
    "identifiedDate": "2024-01-09T13:15:00Z",
    "lastReviewed": "2024-01-16T11:30:00Z"
  },
  {
    "id": "RISK-007",
    "title": "Scope creep from stakeholder requests",
    "description": "Multiple stakeholder groups may request additional features that could significantly expand scope beyond the MVP timeline and budget.",
    "category": "business", 
    "probability": 4,
    "impact": 3,
    "owner": "Mandy",
    "status": "monitoring",
    "mitigation": "Clear feature prioritization framework, regular stakeholder alignment meetings, and formal change request process with impact assessment.",
    "contingency": "Defer non-critical features to Phase 2 and maintain strict MVP focus",
    "identifiedDate": "2024-01-13T16:40:00Z",
    "lastReviewed": "2024-01-16T12:05:00Z"
  },
  {
    "id": "RISK-008",
    "title": "Data privacy and compliance requirements", 
    "description": "Handling project data from multiple organizations may require compliance with various data protection regulations (GDPR, SOC2, etc.).",
    "category": "business",
    "probability": 3,
    "impact": 5,
    "owner": "Krin",
    "status": "identified",
    "mitigation": "Data classification framework, encryption at rest and in transit, audit logging, and privacy-by-design architecture. Legal compliance review scheduled.",
    "contingency": "Implement data residency controls and customer-managed encryption keys",
    "identifiedDate": "2024-01-15T10:25:00Z",
    "lastReviewed": "2024-01-16T15:45:00Z"
  }
]